### pandas loc and iloc

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('lec_15_ka_csv_file.csv')
df

   student id  class  percentage  hrs
0        1001     10          30    5
1        1002      9          53    6
2        1003     13          55    8
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2
6        1007     10          68    3

In [3]:
df.loc[0]

student id    1001
class           10
percentage      30
hrs              5
Name: 0, dtype: int64

In [4]:
df.loc[5]

student id    1006
class            9
percentage      87
hrs              2
Name: 5, dtype: int64

In [5]:
df.loc[[1,3,6]]

   student id  class  percentage  hrs
1        1002      9          53    6
3        1004      8          46    9
6        1007     10          68    3

In [6]:
df.loc[[0,2]]

   student id  class  percentage  hrs
0        1001     10          30    5
2        1003     13          55    8

In [7]:
df

   student id  class  percentage  hrs
0        1001     10          30    5
1        1002      9          53    6
2        1003     13          55    8
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2
6        1007     10          68    3

In [8]:
df.loc[4,'hrs']

4

In [9]:
df.loc[0:3,'hrs']

0    5
1    6
2    8
3    9
Name: hrs, dtype: int64

In [10]:
df.loc[0:3,['percentage','hrs']]

   percentage  hrs
0          30    5
1          53    6
2          55    8
3          46    9

In [11]:
df

   student id  class  percentage  hrs
0        1001     10          30    5
1        1002      9          53    6
2        1003     13          55    8
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2
6        1007     10          68    3

In [12]:
df.loc[[True,False,True,False,False,True,False]]#true wala aayega

   student id  class  percentage  hrs
0        1001     10          30    5
2        1003     13          55    8
5        1006      9          87    2

In [13]:
df

   student id  class  percentage  hrs
0        1001     10          30    5
1        1002      9          53    6
2        1003     13          55    8
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2
6        1007     10          68    3

In [15]:
df.loc[df['class']<10]

   student id  class  percentage  hrs
1        1002      9          53    6
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2

In [16]:
df.loc[df['class']<10,'hrs']

1    6
3    9
4    4
5    2
Name: hrs, dtype: int64

In [17]:
df.loc[df['class']<10,['hrs']]

   hrs
1    6
3    9
4    4
5    2

In [18]:
df.iloc[0]

student id    1001
class           10
percentage      30
hrs              5
Name: 0, dtype: int64

In [19]:
df.iloc[[0]]

   student id  class  percentage  hrs
0        1001     10          30    5

In [21]:
df.iloc[:4]

   student id  class  percentage  hrs
0        1001     10          30    5
1        1002      9          53    6
2        1003     13          55    8
3        1004      8          46    9

In [22]:
df.iloc[3:]

   student id  class  percentage  hrs
3        1004      8          46    9
4        1005      6          65    4
5        1006      9          87    2
6        1007     10          68    3

In [23]:
df.iloc[3:,0]

3    1004
4    1005
5    1006
6    1007
Name: student id, dtype: int64

In [24]:
df.iloc[3:,[0]]

   student id
3        1004
4        1005
5        1006
6        1007

In [29]:
df.iloc[[True,False,False,True,True,False,False]]

   student id  class  percentage  hrs
0        1001     10          30    5
3        1004      8          46    9
4        1005      6          65    4